<!-- Pandas  -->

# Pandas

In [2]:
import numpy as np
import pandas as pd

In [4]:
# series - one dimenstion array object

data = [1,2,3,4]

series = pd.Series(data)
print(series)
type(series)

0    1
1    2
2    3
3    4
dtype: int64

pandas.core.series.Series

In [5]:
# create a series from dictionary

data = {
    'a':1,
    'b':2,
    'c':3,
    'd':4
}

series = pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
data = [10,20,30]
new_index = ['a','b','c']

pd.Series(data,index = new_index)

a    10
b    20
c    30
dtype: int64

In [10]:
# DataFrame - 2d
# create a dataframe from dictionary

data = {
    # colname     values
    'Name' : ['Wasif','Hossain','Jhony'],
    'Age' : [23,18,15],
    'City' : ['New york','Uttara','Sydney']
}

df = pd.DataFrame(data)
display(df)
print(type(df))

      Name  Age      City
0    Wasif   23  New york
1  Hossain   18    Uttara
2    Jhony   15    Sydney

<class 'pandas.core.frame.DataFrame'>

In [8]:
# convert the df into array

np.array(df)

array([['Wasif', 23, 'New york'],
       ['Hossain', 18, 'Uttara'],
       ['Jhony', 15, 'Sydney']], dtype=object)

In [12]:
# create df form list of dict

data = [
    {"Name": "Wasif", "Age": 23, "City": "Dhaka"},
    {"Name": "Sunny", "Age": 23, "City": "Dhaka"},
    {"Name": "Rejoan", "Age": 23, "City": "Dhaka"},
    {"Name": "Hasan", "Age": 23, "City": "Dhaka"},
    {"Name": "Galib", "Age": 23, "City": "Dhaka"}
]

df = pd.DataFrame(data)
display(df)
print(type(df))

     Name  Age   City
0   Wasif   23  Dhaka
1   Sunny   23  Dhaka
2  Rejoan   23  Dhaka
3   Hasan   23  Dhaka
4   Galib   23  Dhaka

<class 'pandas.core.frame.DataFrame'>

In [16]:
df = pd.read_csv("titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# we can directly access column like this

# df['embark_town'] and it will become series
df['embark_town'].head()

0    Southampton
1      Cherbourg
2    Southampton
3    Southampton
4    Southampton
Name: embark_town, dtype: object

In [20]:
data = [
    {"Name": "John", "Age": 22, "City": "Dhaka"},
    {"Name": "Jack", "Age": 24, "City": "Chattogram"},
    {"Name": "Emily", "Age": 21, "City": "Sylhet"},
    {"Name": "Sophia", "Age": 23, "City": "Rajshahi"},
    {"Name": "Michael", "Age": 25, "City": "Khulna"}
]
df = pd.DataFrame(data)
df

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [24]:
df.loc[0]["Name"]

'John'

In [ ]:
df.iloc[2]

Name     Emily
Age         21
City    Sylhet
Name: 2, dtype: object

In [26]:
df.iloc[2][1]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_1984\2023769522.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[2][1]

np.int64(21)

In [35]:
# adding a column 

df['Salary'] = [2,3,4,5,6]
df

      Name  Age        City  Salary
0     John   22       Dhaka       2
1     Jack   24  Chattogram       3
2    Emily   21      Sylhet       4
3   Sophia   23    Rajshahi       5
4  Michael   25      Khulna       6

In [36]:
# two ways to make it permanent drop
# df = df.drop('Salary', axis=1)
# df.drop('Salary', axis=1 , inplace=True)
# x axis or row axis = 0
# y axis or col axis = 1
df.drop('Salary', axis=1)

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [37]:
df

      Name  Age        City  Salary
0     John   22       Dhaka       2
1     Jack   24  Chattogram       3
2    Emily   21      Sylhet       4
3   Sophia   23    Rajshahi       5
4  Michael   25      Khulna       6

In [38]:
df.drop('Salary', axis=1, inplace=True)

In [39]:
df

      Name  Age        City
0     John   22       Dhaka
1     Jack   24  Chattogram
2    Emily   21      Sylhet
3   Sophia   23    Rajshahi
4  Michael   25      Khulna

In [ ]:
df["Age"] = df["Age"] + 1 # each of them
df

      Name  Age        City
0     John   24       Dhaka
1     Jack   26  Chattogram
2    Emily   23      Sylhet
3   Sophia   25    Rajshahi
4  Michael   27      Khulna